perftest/gin_cache/gin_cache_post.txt
[ POST /channel 200][1]

Summary:
  Total:	60.0223 secs
  Slowest:	0.2381 secs
  Fastest:	0.0015 secs
  Average:	0.0226 secs
  Requests/sec:	2215.1763
  
  Total data:	2526240 bytes
  Size/request:	19 bytes

Response time histogram:
  0.001 [1]	|
  0.025 [90535]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.049 [32795]	|■■■■■■■■■■■■■■
  0.072 [7415]	|■■■
  0.096 [1690]	|■
  0.120 [409]	|
  0.143 [79]	|
  0.167 [26]	|
  0.191 [8]	|
  0.214 [0]	|
  0.238 [2]	|


Latency distribution:
  10% in 0.0087 secs
  25% in 0.0108 secs
  50% in 0.0176 secs
  75% in 0.0289 secs
  90% in 0.0436 secs
  95% in 0.0547 secs
  99% in 0.0804 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0015 secs, 0.2381 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0048 secs
  resp wait:	0.0225 secs, 0.0014 secs, 0.2380 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0059 secs

Status code distribution:
  [201]	132960 responses



[ POST /channel 200][2]

Summary:
  Total:	60.0179 secs
  Slowest:	0.2088 secs
  Fastest:	0.0018 secs
  Average:	0.0235 secs
  Requests/sec:	2129.2147
  
  Total data:	2428029 bytes
  Size/request:	19 bytes

Response time histogram:
  0.002 [1]	|
  0.022 [77013]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.043 [36062]	|■■■■■■■■■■■■■■■■■■■
  0.064 [10346]	|■■■■■
  0.085 [3042]	|■■
  0.105 [911]	|
  0.126 [306]	|
  0.147 [71]	|
  0.167 [25]	|
  0.188 [4]	|
  0.209 [10]	|


Latency distribution:
  10% in 0.0090 secs
  25% in 0.0110 secs
  50% in 0.0182 secs
  75% in 0.0301 secs
  90% in 0.0455 secs
  95% in 0.0574 secs
  99% in 0.0852 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0018 secs, 0.2088 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0070 secs
  resp wait:	0.0234 secs, 0.0017 secs, 0.2088 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0085 secs

Status code distribution:
  [201]	127791 responses



[ POST /channel 200][3]

Summary:
  Total:	60.0178 secs
  Slowest:	0.1945 secs
  Fastest:	0.0018 secs
  Average:	0.0232 secs
  Requests/sec:	2149.7962
  
  Total data:	2451494 bytes
  Size/request:	19 bytes

Response time histogram:
  0.002 [1]	|
  0.021 [72711]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.040 [39141]	|■■■■■■■■■■■■■■■■■■■■■■
  0.060 [11829]	|■■■■■■■
  0.079 [3662]	|■■
  0.098 [1169]	|■
  0.117 [363]	|
  0.137 [107]	|
  0.156 [31]	|
  0.175 [9]	|
  0.195 [3]	|


Latency distribution:
  10% in 0.0090 secs
  25% in 0.0110 secs
  50% in 0.0181 secs
  75% in 0.0298 secs
  90% in 0.0451 secs
  95% in 0.0566 secs
  99% in 0.0831 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0018 secs, 0.1945 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0048 secs
  resp wait:	0.0232 secs, 0.0018 secs, 0.1944 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0079 secs

Status code distribution:
  [201]	129026 responses



[ POST /channel 200][4]

Summary:
  Total:	60.0201 secs
  Slowest:	0.1927 secs
  Fastest:	0.0018 secs
  Average:	0.0227 secs
  Requests/sec:	2197.2319
  
  Total data:	2505682 bytes
  Size/request:	19 bytes

Response time histogram:
  0.002 [1]	|
  0.021 [75064]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.040 [39849]	|■■■■■■■■■■■■■■■■■■■■■
  0.059 [11639]	|■■■■■■
  0.078 [3659]	|■■
  0.097 [1136]	|■
  0.116 [360]	|
  0.135 [129]	|
  0.155 [27]	|
  0.174 [8]	|
  0.193 [6]	|


Latency distribution:
  10% in 0.0088 secs
  25% in 0.0108 secs
  50% in 0.0177 secs
  75% in 0.0290 secs
  90% in 0.0442 secs
  95% in 0.0555 secs
  99% in 0.0824 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0018 secs, 0.1927 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0086 secs
  resp wait:	0.0227 secs, 0.0017 secs, 0.1926 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0067 secs

Status code distribution:
  [201]	131878 responses



[ POST /channel 200][5]

Summary:
  Total:	60.0185 secs
  Slowest:	0.1988 secs
  Fastest:	0.0016 secs
  Average:	0.0228 secs
  Requests/sec:	2192.5564
  
  Total data:	2500286 bytes
  Size/request:	19 bytes

Response time histogram:
  0.002 [1]	|
  0.021 [76449]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.041 [39198]	|■■■■■■■■■■■■■■■■■■■■■
  0.061 [11249]	|■■■■■■
  0.081 [3275]	|■■
  0.100 [1021]	|■
  0.120 [281]	|
  0.140 [79]	|
  0.159 [28]	|
  0.179 [9]	|
  0.199 [4]	|


Latency distribution:
  10% in 0.0090 secs
  25% in 0.0107 secs
  50% in 0.0176 secs
  75% in 0.0291 secs
  90% in 0.0443 secs
  95% in 0.0552 secs
  99% in 0.0819 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0016 secs, 0.1988 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0053 secs
  resp wait:	0.0227 secs, 0.0016 secs, 0.1988 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0072 secs

Status code distribution:
  [201]	131594 responses



[ POST /channel 400][1]

Summary:
  Total:	60.0196 secs
  Slowest:	0.2122 secs
  Fastest:	0.0016 secs
  Average:	0.0236 secs
  Requests/sec:	2118.1402
  
  Total data:	2415470 bytes
  Size/request:	19 bytes

Response time histogram:
  0.002 [1]	|
  0.023 [76534]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.044 [36277]	|■■■■■■■■■■■■■■■■■■■
  0.065 [10157]	|■■■■■
  0.086 [2945]	|■■
  0.107 [842]	|
  0.128 [254]	|
  0.149 [87]	|
  0.170 [24]	|
  0.191 [4]	|
  0.212 [5]	|


Latency distribution:
  10% in 0.0091 secs
  25% in 0.0112 secs
  50% in 0.0183 secs
  75% in 0.0302 secs
  90% in 0.0458 secs
  95% in 0.0577 secs
  99% in 0.0852 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0016 secs, 0.2122 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0057 secs
  resp wait:	0.0235 secs, 0.0015 secs, 0.2122 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0087 secs

Status code distribution:
  [201]	127130 responses



[ POST /channel 400][2]

Summary:
  Total:	60.0263 secs
  Slowest:	0.1984 secs
  Fastest:	0.0017 secs
  Average:	0.0231 secs
  Requests/sec:	2159.3852
  
  Total data:	2462780 bytes
  Size/request:	19 bytes

Response time histogram:
  0.002 [1]	|
  0.021 [74069]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.041 [39371]	|■■■■■■■■■■■■■■■■■■■■■
  0.061 [11222]	|■■■■■■
  0.080 [3422]	|■■
  0.100 [1091]	|■
  0.120 [313]	|
  0.139 [94]	|
  0.159 [21]	|
  0.179 [10]	|
  0.198 [6]	|


Latency distribution:
  10% in 0.0090 secs
  25% in 0.0110 secs
  50% in 0.0180 secs
  75% in 0.0295 secs
  90% in 0.0449 secs
  95% in 0.0563 secs
  99% in 0.0832 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0017 secs, 0.1984 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0049 secs
  resp wait:	0.0231 secs, 0.0016 secs, 0.1984 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0057 secs

Status code distribution:
  [201]	129620 responses



[ POST /channel 400][3]

Summary:
  Total:	60.0200 secs
  Slowest:	0.2291 secs
  Fastest:	0.0017 secs
  Average:	0.0231 secs
  Requests/sec:	2159.6316
  
  Total data:	2462799 bytes
  Size/request:	19 bytes

Response time histogram:
  0.002 [1]	|
  0.024 [85194]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.047 [33175]	|■■■■■■■■■■■■■■■■
  0.070 [8314]	|■■■■
  0.093 [2183]	|■
  0.115 [546]	|
  0.138 [157]	|
  0.161 [38]	|
  0.184 [7]	|
  0.206 [4]	|
  0.229 [2]	|


Latency distribution:
  10% in 0.0089 secs
  25% in 0.0110 secs
  50% in 0.0180 secs
  75% in 0.0296 secs
  90% in 0.0449 secs
  95% in 0.0564 secs
  99% in 0.0833 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0017 secs, 0.2291 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0052 secs
  resp wait:	0.0231 secs, 0.0016 secs, 0.2290 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0094 secs

Status code distribution:
  [201]	129621 responses



[ POST /channel 400][4]

Summary:
  Total:	60.0194 secs
  Slowest:	0.1903 secs
  Fastest:	0.0017 secs
  Average:	0.0233 secs
  Requests/sec:	2142.9065
  
  Total data:	2443704 bytes
  Size/request:	19 bytes

Response time histogram:
  0.002 [1]	|
  0.021 [70599]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.039 [39602]	|■■■■■■■■■■■■■■■■■■■■■■
  0.058 [12431]	|■■■■■■■
  0.077 [4115]	|■■
  0.096 [1268]	|■
  0.115 [414]	|
  0.134 [123]	|
  0.153 [42]	|
  0.171 [16]	|
  0.190 [5]	|


Latency distribution:
  10% in 0.0090 secs
  25% in 0.0110 secs
  50% in 0.0181 secs
  75% in 0.0298 secs
  90% in 0.0454 secs
  95% in 0.0570 secs
  99% in 0.0838 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0017 secs, 0.1903 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0082 secs
  resp wait:	0.0232 secs, 0.0016 secs, 0.1902 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0090 secs

Status code distribution:
  [201]	128616 responses



[ POST /channel 400][5]

Summary:
  Total:	60.0206 secs
  Slowest:	0.2321 secs
  Fastest:	0.0018 secs
  Average:	0.0237 secs
  Requests/sec:	2106.4427
  
  Total data:	2402170 bytes
  Size/request:	19 bytes

Response time histogram:
  0.002 [1]	|
  0.025 [82368]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.048 [32914]	|■■■■■■■■■■■■■■■■
  0.071 [8273]	|■■■■
  0.094 [2118]	|■
  0.117 [574]	|
  0.140 [145]	|
  0.163 [25]	|
  0.186 [9]	|
  0.209 [2]	|
  0.232 [1]	|


Latency distribution:
  10% in 0.0092 secs
  25% in 0.0112 secs
  50% in 0.0185 secs
  75% in 0.0303 secs
  90% in 0.0458 secs
  95% in 0.0576 secs
  99% in 0.0851 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0018 secs, 0.2321 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0064 secs
  resp wait:	0.0236 secs, 0.0017 secs, 0.2320 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0057 secs

Status code distribution:
  [201]	126430 responses



[ POST /channel 600][1]

Summary:
  Total:	60.0196 secs
  Slowest:	0.2427 secs
  Fastest:	0.0018 secs
  Average:	0.0237 secs
  Requests/sec:	2107.9795
  
  Total data:	2403880 bytes
  Size/request:	19 bytes

Response time histogram:
  0.002 [1]	|
  0.026 [84776]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.050 [31660]	|■■■■■■■■■■■■■■■
  0.074 [7601]	|■■■■
  0.098 [1863]	|■
  0.122 [480]	|
  0.146 [98]	|
  0.170 [32]	|
  0.195 [6]	|
  0.219 [2]	|
  0.243 [1]	|


Latency distribution:
  10% in 0.0091 secs
  25% in 0.0112 secs
  50% in 0.0186 secs
  75% in 0.0304 secs
  90% in 0.0461 secs
  95% in 0.0577 secs
  99% in 0.0858 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0018 secs, 0.2427 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0047 secs
  resp wait:	0.0236 secs, 0.0017 secs, 0.2427 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0060 secs

Status code distribution:
  [201]	126520 responses



[ POST /channel 600][2]

Summary:
  Total:	60.0226 secs
  Slowest:	0.2085 secs
  Fastest:	0.0017 secs
  Average:	0.0238 secs
  Requests/sec:	2101.7906
  
  Total data:	2396945 bytes
  Size/request:	19 bytes

Response time histogram:
  0.002 [1]	|
  0.022 [74563]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.043 [36490]	|■■■■■■■■■■■■■■■■■■■■
  0.064 [10572]	|■■■■■■
  0.084 [3243]	|■■
  0.105 [883]	|
  0.126 [278]	|
  0.146 [91]	|
  0.167 [29]	|
  0.188 [3]	|
  0.209 [2]	|


Latency distribution:
  10% in 0.0092 secs
  25% in 0.0113 secs
  50% in 0.0186 secs
  75% in 0.0305 secs
  90% in 0.0461 secs
  95% in 0.0580 secs
  99% in 0.0847 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0017 secs, 0.2085 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0091 secs
  resp wait:	0.0237 secs, 0.0016 secs, 0.2084 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0064 secs

Status code distribution:
  [201]	126155 responses



[ POST /channel 600][3]

Summary:
  Total:	60.0181 secs
  Slowest:	0.2904 secs
  Fastest:	0.0017 secs
  Average:	0.0238 secs
  Requests/sec:	2101.3338
  
  Total data:	2396242 bytes
  Size/request:	19 bytes

Response time histogram:
  0.002 [1]	|
  0.031 [94853]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.059 [25535]	|■■■■■■■■■■■
  0.088 [4632]	|■■
  0.117 [905]	|
  0.146 [152]	|
  0.175 [31]	|
  0.204 [4]	|
  0.233 [4]	|
  0.261 [0]	|
  0.290 [1]	|


Latency distribution:
  10% in 0.0092 secs
  25% in 0.0113 secs
  50% in 0.0186 secs
  75% in 0.0304 secs
  90% in 0.0462 secs
  95% in 0.0577 secs
  99% in 0.0859 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0017 secs, 0.2904 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0072 secs
  resp wait:	0.0237 secs, 0.0016 secs, 0.2903 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0054 secs

Status code distribution:
  [201]	126118 responses



[ POST /channel 600][4]

Summary:
  Total:	60.0207 secs
  Slowest:	0.1964 secs
  Fastest:	0.0019 secs
  Average:	0.0243 secs
  Requests/sec:	2061.0396
  
  Total data:	2350395 bytes
  Size/request:	19 bytes

Response time histogram:
  0.002 [1]	|
  0.021 [68434]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.041 [37550]	|■■■■■■■■■■■■■■■■■■■■■■
  0.060 [12024]	|■■■■■■■
  0.080 [3794]	|■■
  0.099 [1240]	|■
  0.119 [455]	|
  0.138 [137]	|
  0.157 [50]	|
  0.177 [18]	|
  0.196 [2]	|


Latency distribution:
  10% in 0.0092 secs
  25% in 0.0116 secs
  50% in 0.0190 secs
  75% in 0.0312 secs
  90% in 0.0470 secs
  95% in 0.0588 secs
  99% in 0.0875 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0019 secs, 0.1964 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0086 secs
  resp wait:	0.0242 secs, 0.0019 secs, 0.1963 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0073 secs

Status code distribution:
  [201]	123705 responses



[ POST /channel 600][5]

Summary:
  Total:	60.0247 secs
  Slowest:	0.2313 secs
  Fastest:	0.0015 secs
  Average:	0.0238 secs
  Requests/sec:	2099.9860
  
  Total data:	2394969 bytes
  Size/request:	19 bytes

Response time histogram:
  0.001 [1]	|
  0.024 [81040]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.047 [33200]	|■■■■■■■■■■■■■■■■
  0.070 [8717]	|■■■■
  0.093 [2253]	|■
  0.116 [620]	|
  0.139 [158]	|
  0.162 [52]	|
  0.185 [7]	|
  0.208 [2]	|
  0.231 [1]	|


Latency distribution:
  10% in 0.0090 secs
  25% in 0.0112 secs
  50% in 0.0186 secs
  75% in 0.0306 secs
  90% in 0.0464 secs
  95% in 0.0583 secs
  99% in 0.0859 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0015 secs, 0.2313 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0071 secs
  resp wait:	0.0237 secs, 0.0014 secs, 0.2312 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0084 secs

Status code distribution:
  [201]	126051 responses



[ POST /channel 800][1]

Summary:
  Total:	60.0204 secs
  Slowest:	0.2274 secs
  Fastest:	0.0017 secs
  Average:	0.0234 secs
  Requests/sec:	2136.2745
  
  Total data:	2436180 bytes
  Size/request:	19 bytes

Response time histogram:
  0.002 [1]	|
  0.024 [83000]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.047 [33549]	|■■■■■■■■■■■■■■■■
  0.069 [8594]	|■■■■
  0.092 [2267]	|■
  0.115 [600]	|
  0.137 [159]	|
  0.160 [36]	|
  0.182 [8]	|
  0.205 [5]	|
  0.227 [1]	|


Latency distribution:
  10% in 0.0090 secs
  25% in 0.0110 secs
  50% in 0.0182 secs
  75% in 0.0300 secs
  90% in 0.0454 secs
  95% in 0.0568 secs
  99% in 0.0839 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0017 secs, 0.2274 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0062 secs
  resp wait:	0.0233 secs, 0.0016 secs, 0.2273 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0057 secs

Status code distribution:
  [201]	128220 responses



[ POST /channel 800][2]

Summary:
  Total:	60.0197 secs
  Slowest:	0.2113 secs
  Fastest:	0.0017 secs
  Average:	0.0240 secs
  Requests/sec:	2081.1849
  
  Total data:	2373328 bytes
  Size/request:	19 bytes

Response time histogram:
  0.002 [1]	|
  0.023 [73970]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.044 [36067]	|■■■■■■■■■■■■■■■■■■■■
  0.065 [10487]	|■■■■■■
  0.086 [3059]	|■■
  0.106 [914]	|
  0.127 [294]	|
  0.148 [79]	|
  0.169 [26]	|
  0.190 [13]	|
  0.211 [2]	|


Latency distribution:
  10% in 0.0092 secs
  25% in 0.0114 secs
  50% in 0.0188 secs
  75% in 0.0308 secs
  90% in 0.0465 secs
  95% in 0.0585 secs
  99% in 0.0868 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0017 secs, 0.2113 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0049 secs
  resp wait:	0.0239 secs, 0.0016 secs, 0.2113 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0068 secs

Status code distribution:
  [201]	124912 responses



[ POST /channel 800][3]

Summary:
  Total:	60.0181 secs
  Slowest:	0.2208 secs
  Fastest:	0.0015 secs
  Average:	0.0237 secs
  Requests/sec:	2104.7981
  
  Total data:	2400194 bytes
  Size/request:	19 bytes

Response time histogram:
  0.001 [1]	|
  0.023 [78505]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.045 [34602]	|■■■■■■■■■■■■■■■■■■
  0.067 [9630]	|■■■■■
  0.089 [2617]	|■
  0.111 [714]	|
  0.133 [183]	|
  0.155 [53]	|
  0.177 [13]	|
  0.199 [4]	|
  0.221 [4]	|


Latency distribution:
  10% in 0.0092 secs
  25% in 0.0113 secs
  50% in 0.0186 secs
  75% in 0.0305 secs
  90% in 0.0461 secs
  95% in 0.0578 secs
  99% in 0.0851 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0015 secs, 0.2208 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0063 secs
  resp wait:	0.0236 secs, 0.0014 secs, 0.2207 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0056 secs

Status code distribution:
  [201]	126326 responses



[ POST /channel 800][4]

Summary:
  Total:	60.0218 secs
  Slowest:	0.2035 secs
  Fastest:	0.0018 secs
  Average:	0.0234 secs
  Requests/sec:	2133.9729
  
  Total data:	2433615 bytes
  Size/request:	19 bytes

Response time histogram:
  0.002 [1]	|
  0.022 [75427]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.042 [36935]	|■■■■■■■■■■■■■■■■■■■■
  0.062 [10961]	|■■■■■■
  0.082 [3363]	|■■
  0.103 [996]	|■
  0.123 [269]	|
  0.143 [95]	|
  0.163 [22]	|
  0.183 [9]	|
  0.203 [7]	|


Latency distribution:
  10% in 0.0090 secs
  25% in 0.0111 secs
  50% in 0.0183 secs
  75% in 0.0300 secs
  90% in 0.0456 secs
  95% in 0.0572 secs
  99% in 0.0842 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0018 secs, 0.2035 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0048 secs
  resp wait:	0.0233 secs, 0.0017 secs, 0.2034 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0075 secs

Status code distribution:
  [201]	128085 responses



[ POST /channel 800][5]

Summary:
  Total:	60.0231 secs
  Slowest:	0.2048 secs
  Fastest:	0.0016 secs
  Average:	0.0232 secs
  Requests/sec:	2158.1539
  
  Total data:	2461241 bytes
  Size/request:	19 bytes

Response time histogram:
  0.002 [1]	|
  0.022 [76855]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.042 [37438]	|■■■■■■■■■■■■■■■■■■■
  0.063 [10725]	|■■■■■■
  0.083 [3208]	|■■
  0.103 [950]	|
  0.124 [242]	|
  0.144 [80]	|
  0.164 [30]	|
  0.184 [9]	|
  0.205 [1]	|


Latency distribution:
  10% in 0.0089 secs
  25% in 0.0109 secs
  50% in 0.0181 secs
  75% in 0.0297 secs
  90% in 0.0451 secs
  95% in 0.0564 secs
  99% in 0.0830 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0016 secs, 0.2048 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0075 secs
  resp wait:	0.0231 secs, 0.0015 secs, 0.2047 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0081 secs

Status code distribution:
  [201]	129539 responses



[ POST /channel 1000][1]

Summary:
  Total:	60.0253 secs
  Slowest:	0.2204 secs
  Fastest:	0.0019 secs
  Average:	0.0241 secs
  Requests/sec:	2071.8256
  
  Total data:	2362878 bytes
  Size/request:	19 bytes

Response time histogram:
  0.002 [1]	|
  0.024 [77444]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.046 [33567]	|■■■■■■■■■■■■■■■■■
  0.067 [9542]	|■■■■■
  0.089 [2642]	|■
  0.111 [804]	|
  0.133 [250]	|
  0.155 [84]	|
  0.177 [22]	|
  0.199 [4]	|
  0.220 [2]	|


Latency distribution:
  10% in 0.0092 secs
  25% in 0.0115 secs
  50% in 0.0188 secs
  75% in 0.0308 secs
  90% in 0.0468 secs
  95% in 0.0589 secs
  99% in 0.0882 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0019 secs, 0.2204 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0074 secs
  resp wait:	0.0240 secs, 0.0018 secs, 0.2203 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0090 secs

Status code distribution:
  [201]	124362 responses



[ POST /channel 1000][2]

Summary:
  Total:	60.0195 secs
  Slowest:	0.2020 secs
  Fastest:	0.0018 secs
  Average:	0.0232 secs
  Requests/sec:	2150.6842
  
  Total data:	2452577 bytes
  Size/request:	19 bytes

Response time histogram:
  0.002 [1]	|
  0.022 [75871]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.042 [37326]	|■■■■■■■■■■■■■■■■■■■■
  0.062 [11139]	|■■■■■■
  0.082 [3336]	|■■
  0.102 [994]	|■
  0.122 [298]	|
  0.142 [85]	|
  0.162 [18]	|
  0.182 [9]	|
  0.202 [6]	|


Latency distribution:
  10% in 0.0090 secs
  25% in 0.0110 secs
  50% in 0.0180 secs
  75% in 0.0298 secs
  90% in 0.0454 secs
  95% in 0.0570 secs
  99% in 0.0834 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0018 secs, 0.2020 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0049 secs
  resp wait:	0.0232 secs, 0.0017 secs, 0.2019 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0072 secs

Status code distribution:
  [201]	129083 responses



[ POST /channel 1000][3]

Summary:
  Total:	60.0233 secs
  Slowest:	0.2113 secs
  Fastest:	0.0017 secs
  Average:	0.0231 secs
  Requests/sec:	2165.0084
  
  Total data:	2469069 bytes
  Size/request:	19 bytes

Response time histogram:
  0.002 [1]	|
  0.023 [80336]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.044 [35682]	|■■■■■■■■■■■■■■■■■■
  0.065 [9917]	|■■■■■
  0.086 [2851]	|■
  0.107 [830]	|
  0.127 [238]	|
  0.148 [56]	|
  0.169 [28]	|
  0.190 [5]	|
  0.211 [7]	|


Latency distribution:
  10% in 0.0089 secs
  25% in 0.0109 secs
  50% in 0.0179 secs
  75% in 0.0296 secs
  90% in 0.0448 secs
  95% in 0.0565 secs
  99% in 0.0839 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0017 secs, 0.2113 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0056 secs
  resp wait:	0.0230 secs, 0.0016 secs, 0.2111 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0080 secs

Status code distribution:
  [201]	129951 responses



[ POST /channel 1000][4]

Summary:
  Total:	60.0299 secs
  Slowest:	0.1988 secs
  Fastest:	0.0017 secs
  Average:	0.0233 secs
  Requests/sec:	2147.2479
  
  Total data:	2449081 bytes
  Size/request:	19 bytes

Response time histogram:
  0.002 [1]	|
  0.021 [74119]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.041 [38223]	|■■■■■■■■■■■■■■■■■■■■■
  0.061 [11476]	|■■■■■■
  0.081 [3481]	|■■
  0.100 [1091]	|■
  0.120 [354]	|
  0.140 [111]	|
  0.159 [29]	|
  0.179 [11]	|
  0.199 [3]	|


Latency distribution:
  10% in 0.0090 secs
  25% in 0.0109 secs
  50% in 0.0180 secs
  75% in 0.0297 secs
  90% in 0.0453 secs
  95% in 0.0568 secs
  99% in 0.0840 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0017 secs, 0.1988 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0049 secs
  resp wait:	0.0232 secs, 0.0016 secs, 0.1987 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0066 secs

Status code distribution:
  [201]	128899 responses



[ POST /channel 1000][5]

Summary:
  Total:	60.0203 secs
  Slowest:	0.2268 secs
  Fastest:	0.0015 secs
  Average:	0.0237 secs
  Requests/sec:	2107.6049
  
  Total data:	2403481 bytes
  Size/request:	19 bytes

Response time histogram:
  0.002 [1]	|
  0.024 [80774]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.047 [33594]	|■■■■■■■■■■■■■■■■■
  0.069 [8834]	|■■■■
  0.092 [2374]	|■
  0.114 [665]	|
  0.137 [200]	|
  0.159 [41]	|
  0.182 [11]	|
  0.204 [3]	|
  0.227 [2]	|


Latency distribution:
  10% in 0.0091 secs
  25% in 0.0112 secs
  50% in 0.0185 secs
  75% in 0.0303 secs
  90% in 0.0459 secs
  95% in 0.0580 secs
  99% in 0.0855 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0015 secs, 0.2268 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0050 secs
  resp wait:	0.0236 secs, 0.0015 secs, 0.2267 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0068 secs

Status code distribution:
  [201]	126499 responses